In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('data/gapminder.tsv',sep='\t')

In [6]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [9]:
df.groupby('year')['lifeExp'].mean().to_frame().reset_index()

    year    lifeExp
0   1952  49.057620
1   1957  51.507401
2   1962  53.609249
3   1967  55.678290
4   1972  57.647386
5   1977  59.570157
6   1982  61.533197
7   1987  63.212613
8   1992  64.160338
9   1997  65.014676
10  2002  65.694923
11  2007  67.007423

In [10]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    return sum/n

In [11]:
df.groupby('year')['lifeExp'].agg(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [13]:
import numpy as np
df.groupby('year')['lifeExp'].agg([np.count_nonzero,np.mean,np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [17]:
df.groupby('year').agg({'lifeExp':'mean',
                        'lifeExp':'median',
                        'pop':'median',
                        'gdpPercap':'median'})

      lifeExp         pop    gdpPercap
year
1952  45.1355   3943953.0  1968.528344
1957  48.3605   4282942.0  2173.220291
1962  50.8810   4686039.5  2335.439533
1967  53.8250   5170175.5  2678.334740
1972  56.5300   5877996.5  3339.129407
1977  59.6720   6404036.5  3798.609244
1982  62.4415   7007320.0  4216.228428
1987  65.8340   7774861.5  4280.300366
1992  67.7030   8688686.5  4386.085502
1997  69.3940   9735063.5  4781.825478
2002  70.8255  10372918.5  5319.804524
2007  71.9355  10517531.0  6124.371108